[
  {
    "title": "The Legend of Zelda Ocarina of Time",
    "description": "La historia del juego se enfoca en el joven héroe Link, quien emprende una aventura en el reino de Hyrule para detener a Ganondorf, rey de la tribu Gerudo, antes de que encuentre la Trifuerza, una reliquia sagrada capaz de concederle cualquier deseo a su poseedor. Para ello, debe viajar a través del tiempo y explorar varios templos con el fin de despertar a algunos sabios que tienen el poder para aprisionar de forma definitiva a Ganondorf. ",
    "cover": "https://upload.wikimedia.org/wikipedia/en/5/57/The_Legend_of_Zelda_Ocarina_of_Time.jpg",
    "genre": ["Acción", "Aventura", "Fantasía"],
    "rating": 99,
    "video": "https://www.youtube.com/embed/F0fPCbtlrCo",
    "platform": ["Nintendo"],
    "launchDate": "November 23,1998",
    "isCompetitive": false
  },
  {
    "title": "Final Fantasy VII",
    "description": "El argumento de Final Fantasy VII se centra en el protagonista Cloud Strife, un mercenario que inicialmente se une al grupo ecoterrorista AVALANCHA para detener el control mundial de la corporación Shinra que está drenando la vida del planeta para usarla como fuente de energía. Conforme la historia avanza, Cloud y sus aliados se ven envueltos en un conflicto que representa una amenaza aún mayor para el mundo, enfrentándose a Sefirot, el antagonista principal del juego.",
    "cover": "https://upload.wikimedia.org/wikipedia/en/c/c2/Final_Fantasy_VII_Box_Art.jpg",
    "genre": ["Rol", "Aventura", "Fantasía"],
    "rating": 92,
    "video": "https://www.youtube.com/embed/MGkD6TjS_OI",
    "platform": ["Sony"],
    "launchDate": "September 3, 1997",
    "isCompetitive": false
  },
  {
    "title": "Metal Gear Solid",
    "description": "Metal Gear Solid sigue a Solid Snake, un soldado que se infiltra en una instalación de armas nucleares para neutralizar la amenaza terrorista de FOXHOUND, una unidad genéticamente mejorada de fuerzas especiales. Snake debe liberar a dos importantes rehenes, confrontar a los terroristas y evitar el lanzamiento de un ataque nuclear. Para ello, cuenta con un equipo de apoyo a distancia que le comunica vía códec información sobre la misión, comandada por el coronel Roy Campbell, y complementada por personal médico, de análisis de datos, expertos en armas y en supervivencia.",
    "cover": "https://coverproject.sfo2.cdn.digitaloceanspaces.com/playstation_1/ps1_metalgearsolid_front_eu_thumb.jpg", 
    "genre": ["Acción"],
    "rating": 94,
    "video": "https://www.youtube.com/embed/z7fhvnjo-Hs",
    "platform": ["Sony"],
    "launchDate": "October 21, 1998",
    "isCompetitive": false
  },
  {
    "title": "Super Mario 64",
    "description": "Es el primer juego de Super Mario que presenta una jugabilidad en 3D, que combina la tradicional de Super Mario, el estilo visual y los personajes en un gran mundo abierto. Bowser, el principal antagonista de la franquicia, invade el castillo de la Princesa Peach y esconde las fuentes de protección del castillo, las Power Stars, en muchos mundos diferentes dentro de pinturas mágicas. Como Mario, el jugador recolecta las Power Stars para desbloquear los suficientes castillos de la Princesa Peach y así llegar a Bowser y rescatarla.",
    "cover": "https://coverproject.sfo2.cdn.digitaloceanspaces.com/nintendo_64/label_n64_supermario64_eu_thumb.jpg", 
    "genre": ["Plataformas"],
    "rating": 94,
    "video": "https://www.youtube.com/embed/8Fk5sRwbEWI",
    "platform": ["Nintendo"],
    "launchDate": "September 26, 1996",
    "isCompetitive": false
  },
  {
    "title": "The Last of Us",
    "description": " Tras un desastre biológico, la mayoría de la población del mundo ha perecido y las calles están desiertas y en ruinas. Nosotros controlaremos a Joel, un hombre acompañado de una joven, Ellie, teniendo que sobrevivir en un mundo lleno de peligros, con otros supervivientes hostiles y una raza de mutantes que nos amenaza a cada paso.",
    "cover": "https://i.3djuegos.com/juegos/8274/last_of_us/fotos/ficha/last_of_us-2190366.webp", 
    "genre": ["Terror","Acción","Aventura"],
    "rating": 95,
    "video": "https://www.youtube.com/embed/OQpdSVF_k_w",
    "platform": ["Sony"],
    "launchDate": "June 14, 2013",
    "isCompetitive": false
  },
  {
    "title": "Grand Theft Auto V",
    "description": " La quinta parte de Grand Theft Auto para PC vuelve a la costa oeste americana, ambientándose en la ciudad de Los Santos (Los Ángeles) y sus alrededores, con una historia ambientada en la actualidad, especialmente en las consecuencias de la crisis económica. Está protagonizada por Michael, Franklin y Trevor, tres criminales con diferentes habilidades, pudiendo cambiar de personaje en todo momento y vivir cada una de sus vidas, así como aprovechar sus habilidades en las misiones.",
    "cover": "https://m.media-amazon.com/images/I/81X9aPJMidL._AC_SL1500_.jpg", 
    "genre": ["Mundo Abierto","Acción","Aventura"],
    "rating": 97,
    "video": "https://www.youtube.com/embed/QkkoHAzjnUs",
    "platform": ["Sony","Xbox","Steam"],
    "launchDate": "September 17, 2013",
    "isCompetitive": false
  },
  {
    "title": "Red Dead Redemption 2",
    "description": "RDR 2 es una epopeya de vaqueros o western sólo en su envoltorio, pues como en todo juego de Rockstar, en su interior nos cuenta una hermosa y triste historia sobre gente que intenta cambiar y no siempre puede. En esta ocasión el videojuego Red Dead Redemption 2 está protagonizado por un bandolero, el mencionado Morgan, que es la mano derecha de Dutch Van der Linde, el líder de la banda de atracadores del mismo nombre, quienes se abren camino por un vasto y abrupto territorio norteamericano robando y luchando para sobrevivir.",
    "cover": "https://assets.vg247.com/current//2018/05/red_dead_redemption_2_cover_art_1.jpg", 
    "genre": ["Mundo Abierto","Acción","Aventura","Western"],
    "rating": 97,
    "video": "https://www.youtube.com/embed/gmA6MrX81z4",
    "platform": ["Sony","Xbox","Steam"],
    "launchDate": "October 26, 2018",
    "isCompetitive": false
  },
  {
    "title": "Tony Hawk's Pro Skater 2",
    "description": "El jugador, jugando como skater profesional (ya sea en la vida real o creado) completa una serie de tareas que resultan en recompensas en efectivo. Con el dinero ganado, el jugador puede comprar mejoras de habilidad, mejores trucos y skates. ",
    "cover": "https://mediamaster.vandal.net/m/430/tony-hawks-pro-skater-2-20196171749128_1.jpg", 
    "genre": ["Deportes"],
    "rating": 97,
    "video": "https://www.youtube.com/embed/-EjIJ7NVouk",
    "platform": ["Sony","Xbox","Nintendo"],
    "launchDate": "September 20, 2000",
    "isCompetitive": false
  },
  {
    "title": "Call of Duty: Modern Warfare 2",
    "description": " En esta entrega el jugador asume los roles de los personajes Joseph Allen, un soldado de los Rangers en las primeras misiones, para luego dar lugar al soldado James Ramírez por el bando estadounidense; y el sargento Gary Roach Sanderson de la Task Force 141 por el bando británico (aunque en esta fuerza de tareas especiales hay miembros de otros países también, como Australia y Canadá). En Modern Warfare 2 el antagonista principal es Vladimir Makarov, un antiguo discípulo de Zakhaev quien luego de perpetrar un ataque terrorista en el aeropuerto internacional moscovita, logra que Estados Unidos, el país que más odia, sea invadido por Rusia.",
    "cover": "https://cdn.mobygames.com/covers/5840507-call-of-duty-modern-warfare-2-xbox-360-front-cover.jpg", 
    "genre": ["Action","Shooter"],
    "rating": 94,
    "video": "https://www.youtube.com/embed/blshENwbHgs",
    "platform": ["Sony","Xbox","Steam"],
    "launchDate": "November 10, 2009",
    "isCompetitive": true
  },
  {
    "title": "Counter Strike: Source",
    "description": " En esta entrega el jugador asume los roles de los personajes Joseph Allen, un soldado de los Rangers en las primeras misiones, para luego dar lugar al soldado James Ramírez por el bando estadounidense; y el sargento Gary Roach Sanderson de la Task Force 141 por el bando británico (aunque en esta fuerza de tareas especiales hay miembros de otros países también, como Australia y Canadá). En Modern Warfare 2 el antagonista principal es Vladimir Makarov, un antiguo discípulo de Zakhaev quien luego de perpetrar un ataque terrorista en el aeropuerto internacional moscovita, logra que Estados Unidos, el país que más odia, sea invadido por Rusia.",
    "cover": "https://m.media-amazon.com/images/M/MV5BMmQ1OWY2NTctMWZlYi00OWViLTg3NWUtMDMwMTI1ZDQwZmVlXkEyXkFqcGdeQXVyODMyNjkzNTg@._V1_.jpg", 
    "genre": ["Action","Shooter"],
    "rating": 88,
    "video": "https://www.youtube.com/embed/bvI62FUDpKA",
    "platform": ["Steam"],
    "launchDate": "October 07, 2004",
    "isCompetitive": true
  }
]
